[
  {
    "title": "Why Organisation Design Is Still the Most Underused Strategic Lever in 2025",
    "date": "2025-10-15",
    "image": "images/strategic_org_design.jpg",
    "excerpt": "In 2025, transformation is no longer a project. It’s a permanent condition. Yet, one of the most critical enablers—organisation design—remains an afterthought.",
    "readTime": "5 min read",
    "slug": "org-design-strategic-lever"
  },
  {
    "title": "Organisation Design Is Not a One-Time Exercise — It’s a Leadership Discipline",
    "date": "2025-10-10",
    "image": "images/leadership_discipline.jpg",
    "excerpt": "In many organisations, “org design” still evokes images of big announcements, new reporting lines, and cascading org charts. There’s usually a burst of activity, and then a drift back to business as usual.",
    "readTime": "5 min read",
    "slug": "org-design-leadership-discipline"
  },
  {
    "title": "Design the Organisation for Strategy—Not Just for Leaders",
    "date": "2025-10-05",
    "image": "images/strategic_realignment_new.jpg",
    "excerpt": "Organisation design is one of the most powerful tools leaders have to translate strategy into execution. It shapes how decisions are made, how teams collaborate, and how value flows through the business.",
    "readTime": "5 min read",
    "slug": "design-strategy-not-leaders"
  },
  {
    "title": "Rethinking Organisation Design: Why Connection Beats Flattening",
    "date": "2025-10-01",
    "image": "images/rethinking_connection.jpg",
    "excerpt": "As markets shift and complexity rises, many organisations instinctively reach for structural fixes—flatten the hierarchy, break the silos, launch agile squads—in the hope of speeding up collaboration and innovation.",
    "readTime": "5 min read",
    "slug": "connection-beats-flattening"
  },
  {
    "title": "Reinventing While Performing: The New Imperative for Indian Organisations",
    "date": "2025-09-25",
    "image": "images/reinventing_performing.jpg",
    "excerpt": "In 2025, many Indian organisations—particularly mid-sized and well-established firms—find themselves at a strategic crossroads. On one side lies a rapidly evolving external environment; on the other, the need for consistent performance.",
    "readTime": "5 min read",
    "slug": "reinventing-while-performing"
  },
  {
    "title": "GenAI and the Future of Organisation Design: A Global Perspective with an Indian Lens",
    "date": "2025-09-20",
    "image": "images/genai_future.jpg",
    "excerpt": "By mid-2025, Generative AI (GenAI) is no longer an emerging trend—it is an embedded force, transforming how businesses operate across sectors, geographies, and functions.",
    "readTime": "5 min read",
    "slug": "genai-org-design"
  }
]